SdaiIndexId
\details
The data type SdaiAggrIndex is used to represent aggregation indices. The C late binding type of
SdaiAggrIndex is represented by an implementation specific handle named SdaiIndexId